openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32m030.h
 * Author             : WCH
 * Version            : V1.0.2
 * Date               : 2024/12/12
 * Description        : CH32M030 Device Peripheral Access Layer Header File.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for 
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#ifndef __CH32M030_H
#define __CH32M030_H

#ifdef __cplusplus
extern "C" {
#endif

#ifndef  HSE_VALUE
#define  HSE_VALUE                ((uint32_t)8000000) /* Value of the External oscillator in Hz */
#endif
/* In the following line adjust the External High Speed oscillator (HSE) Startup Timeout value */
#define HSE_STARTUP_TIMEOUT       ((uint16_t)0x2000) /* Time out for HSE start up */

#define HSI_VALUE                 ((uint32_t)8000000) /* Value of the Internal oscillator in Hz */

/* CH32M030 Standard Peripheral Library version number */
#define __CH32M030_STDPERIPH_VERSION_MAIN   (0x01) /* [15:8] main version */
#define __CH32M030_STDPERIPH_VERSION_SUB    (0x02) /* [7:0] sub version */
#define __CH32M030_STDPERIPH_VERSION        ( (__CH32M030_STDPERIPH_VERSION_MAIN << 8)\
                                             |(__CH32M030_STDPERIPH_VERSION_SUB << 0))

/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
    /******  RISC-V Processor Exceptions Numbers *******************************************************/
    NonMaskableInt_IRQn = 2, /* 2 Non Maskable Interrupt                             */
    EXC_IRQn = 3,            /* 3 Exception Interrupt                                */
    Ecall_M_Mode_IRQn = 5,   /* 5 Ecall M Mode Interrupt                             */
    Ecall_U_Mode_IRQn = 8,   /* 8 Ecall U Mode Interrupt                             */
    Break_Point_IRQn = 9,    /* 9 Break Point Interrupt                              */
    SysTick_IRQn = 12,       /* 12 System timer Interrupt                            */
    Software_IRQn = 14,      /* 14 software Interrupt                                */

    /******  RISC-V specific Interrupt Numbers *********************************************************/
    WWDG_IRQn = 16,          /* Window WatchDog Interrupt                            */
    OPA_IRQn = 17,           /* OPA global Interrupt                                 */
    FLASH_IRQn = 18,         /* FLASH global Interrupt                               */
    RCC_IRQn = 19,           /* RCC global Interrupt                                 */
    EXTI7_0_IRQn = 20,       /* External Line[7:0] Interrupts                        */
    AWU_IRQn = 21,           /* AWU global Interrupt                                 */
    DMA1_Channel1_IRQn = 22, /* DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn = 23, /* DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn = 24, /* DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn = 25, /* DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn = 26, /* DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn = 27, /* DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn = 28, /* DMA1 Channel 7 global Interrupt                      */
    ADC_IRQn = 29,           /* ADC1 global Interrupt                                */
    I2C1_EV_IRQn = 30,       /* I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn = 31,       /* I2C1 Error Interrupt                                 */
    USART1_IRQn = 32,        /* USART1 global Interrupt                               */
    EXTI15_8_IRQn = 33,      /* External Line[15:8] Interrupts                       */
    TIM1_BRK_IRQn = 34,      /* TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn = 35,       /* TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn = 36,  /* TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn = 37,       /* TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn = 38,          /* TIM2 global Interrupt                                */
    USBPD0_IRQn = 39,        /* USBPD0 global Interrupt                              */
    USBPD0WakeUp_IRQn = 40,  /* USBPD0 WakeUp Interrupt                              */
    USBPD1_IRQn = 41,        /* USBPD1 global Interrupt                              */
    USBPD1WakeUp_IRQn = 42,  /* USBPD1 WakeUp Interrupt                              */
    TIM3_IRQn = 43,          /* TIM3 global Interrupt                                */
    SPI1_IRQn = 44,          /* SPI1 global Interrupt                                */
    USBFS_IRQn = 45,         /* USBFS Interrupt                                      */
    USBFSWakeUp_IRQn = 46,   /* USBFS WakeUp from suspend through EXTI Line Interrupt*/
} IRQn_Type;


#define HardFault_IRQn    EXC_IRQn

#include <stdint.h>
#include "core_riscv.h"
#include "system_ch32m030.h"

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE
#define HSE_Value             HSE_VALUE
#define HSEStartUp_TimeOut    HSE_STARTUP_TIMEOUT

/* Analog to Digital Converter */
typedef struct
{
    __IO uint32_t STATR;
    __IO uint32_t CTLR1;
    __IO uint32_t CTLR2;
    __IO uint32_t SAMPTR1;
    __IO uint32_t SAMPTR2;
    __IO uint32_t IOFR1;
    __IO uint32_t IOFR2;
    __IO uint32_t IOFR3;
    __IO uint32_t IOFR4;
    __IO uint32_t WDHTR;
    __IO uint32_t WDLTR;
    __IO uint32_t RSQR1;
    __IO uint32_t RSQR2;
    __IO uint32_t RSQR3;
    __IO uint32_t ISQR;
    __IO uint32_t IDATAR1;
    __IO uint32_t IDATAR2;
    __IO uint32_t IDATAR3;
    __IO uint32_t IDATAR4;
    __IO uint32_t RDATAR;
    __IO uint32_t CTLR3;
    __IO uint32_t WDTR1;
    __IO uint32_t WDTR2;
    __IO uint32_t AVGTR;
    __IO uint32_t DLYR;
    __IO uint32_t AVGDR;
    __IO uint32_t RDATAR2;
    __IO uint32_t RDATAR3;
    __IO uint32_t RDATAR4;
} ADC_TypeDef;

