openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/* Debug MCU */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
} DBGMCU_TypeDef;

/* DMA Controller */
typedef struct
{
    __IO uint32_t CFGR;
    __IO uint32_t CNTR;
    __IO uint32_t PADDR;
    __IO uint32_t MADDR;
} DMA_Channel_TypeDef;

typedef struct
{
    __IO uint32_t INTFR;
    __IO uint32_t INTFCR;
} DMA_TypeDef;

/* External Interrupt/Event Controller */
typedef struct
{
    __IO uint32_t INTENR;
    __IO uint32_t EVENR;
    __IO uint32_t RTENR;
    __IO uint32_t FTENR;
    __IO uint32_t SWIEVR;
    __IO uint32_t INTFR;
} EXTI_TypeDef;

/* FLASH Registers */
typedef struct
{
    __IO uint32_t ACTLR;
    __IO uint32_t KEYR;
    __IO uint32_t OBKEYR;
    __IO uint32_t STATR;
    __IO uint32_t CTLR;
    __IO uint32_t ADDR;
    __IO uint32_t RESERVED;
    __IO uint32_t OBR;
    __IO uint32_t WPR;
    __IO uint32_t MODEKEYR;
    uint32_t      RESERVED0;
    uint16_t      RESERVED1;
    uint8_t       RESERVED2;
    __IO uint8_t  CTLR2;
} FLASH_TypeDef;

/* Option Bytes Registers */
typedef struct
{
    __IO uint16_t RDPR;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRPR0;
    __IO uint16_t WRPR1;
    __IO uint16_t WRPR2;
    __IO uint16_t WRPR3;
} OB_TypeDef;

/* General Purpose I/O */
typedef struct
{
    __IO uint32_t CFGLR;
    __IO uint32_t CFGHR;
    __IO uint32_t INDR;
    __IO uint32_t OUTDR;
    __IO uint32_t BSHR;
    __IO uint32_t BCR;
    __IO uint32_t LCKR;
} GPIO_TypeDef;

/* Alternate Function I/O */
typedef struct
{
    uint32_t      RESERVED0;
    __IO uint32_t PCFR1;
    __IO uint32_t EXTICR;
} AFIO_TypeDef;

/* Inter Integrated Circuit Interface */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t OADDR1;
    uint16_t      RESERVED2;
    __IO uint16_t OADDR2;
    uint16_t      RESERVED3;
    __IO uint16_t DATAR;
    uint16_t      RESERVED4;
    __IO uint16_t STAR1;
    uint16_t      RESERVED5;
    __IO uint16_t STAR2;
    uint16_t      RESERVED6;
    __IO uint16_t CKCFGR;
    uint16_t      RESERVED7;
} I2C_TypeDef;

/* Power Control */
typedef struct
{
    __IO uint32_t CTLR;
    uint32_t      RESERVED0;
    __IO uint32_t AWUCSR;
    __IO uint32_t AWUWR;
} PWR_TypeDef;

/* Reset and Clock Control */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CFGR0;
    __IO uint32_t INTR;
    __IO uint32_t PB2PRSTR;
    __IO uint32_t PB1PRSTR;
    __IO uint32_t HBPCENR;
    __IO uint32_t PB2PCENR;
    __IO uint32_t PB1PCENR;
    __IO uint32_t RESERVED0;
    __IO uint32_t RSTSCKR;
    __IO uint32_t HBPRSTR;
} RCC_TypeDef;

/* Serial Peripheral Interface */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t STATR;
    uint16_t      RESERVED2;
    __IO uint16_t DATAR;
    uint16_t      RESERVED3;
    __IO uint16_t CRCR;
    uint16_t      RESERVED4;
    __IO uint16_t RCRCR;
    uint16_t      RESERVED5;
    __IO uint16_t TCRCR;
    uint16_t      RESERVED6;
    uint32_t      RESERVED7;
    uint32_t      RESERVED8;
    __IO uint16_t HSCR;
    uint16_t      RESERVED9;
} SPI_TypeDef;

/* TIM */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t SMCFGR;
    uint16_t      RESERVED2;
    __IO uint16_t DMAINTENR;
    uint16_t      RESERVED3;
    __IO uint16_t INTFR;
    uint16_t      RESERVED4;
    __IO uint16_t SWEVGR;
    uint16_t      RESERVED5;
    __IO uint16_t CHCTLR1;
    uint16_t      RESERVED6;
    __IO uint16_t CHCTLR2;
    uint16_t      RESERVED7;
    __IO uint16_t CCER;
    uint16_t      RESERVED8;
    __IO uint16_t CNT;
    uint16_t      RESERVED9;
    __IO uint16_t PSC;
    uint16_t      RESERVED10;
    __IO uint16_t ATRLR;
    uint16_t      RESERVED11;
    __IO uint16_t RPTCR;
    uint16_t      RESERVED12;
    __IO uint32_t CH1CVR;
    __IO uint32_t CH2CVR;
    __IO uint32_t CH3CVR;
    __IO uint32_t CH4CVR;
    union
    {
        __IO uint16_t BDTR;
        __IO uint16_t TIM2_DTCR;
    };
    uint16_t      RESERVED13;
    __IO uint16_t DMACFGR;
    uint16_t      RESERVED14;
    __IO uint16_t DMAADR;
    uint16_t      RESERVED15;
    __IO uint16_t TIM1_AUX1;
    uint16_t      RESERVED16;
    __IO uint16_t TIM1_AUX2;
    uint16_t      RESERVED17;
    __IO uint16_t TIM1_CH5CVR;
    uint16_t      RESERVED18;
    __IO uint16_t TIM1_CH6CVR;
    uint16_t      RESERVED19;
    __IO uint16_t TIM1_CH7CVR;
    uint16_t      RESERVED20;
    __IO uint16_t TIM1_CH8CVR;
    uint16_t      RESERVED21;
} TIM_TypeDef;

/* Universal Synchronous Asynchronous Receiver Transmitter */
typedef struct
{
    __IO uint16_t STATR;
    uint16_t      RESERVED0;
    __IO uint16_t DATAR;
    uint16_t      RESERVED1;
    __IO uint16_t BRR;
    uint16_t      RESERVED2;
    __IO uint16_t CTLR1;
    uint16_t      RESERVED3;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED4;
    __IO uint16_t CTLR3;
    uint16_t      RESERVED5;
    __IO uint16_t GPR;
    uint16_t      RESERVED6;
} USART_TypeDef;

/* Window WatchDog */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CFGR;
    __IO uint32_t STATR;
} WWDG_TypeDef;

/* Enhanced Registers */
typedef struct
{
    __IO uint32_t EXTEN_CTLR0;
    __IO uint32_t EXTEN_KEYR;
    __IO uint32_t EXTEN_CTLR1;
    union
    {
        __IO uint32_t EXTEN_CTLR2;
        struct
        {
            __IO uint16_t ISINK1_CFGR;
            __IO uint16_t ISINK2_CFGR;
        };
    };
} EXTEN_TypeDef;

/* OPA Registers */
typedef struct
{
    __IO uint32_t QII_CFGR;
    __IO uint32_t ISP_CTLR;
    __IO uint32_t CMP_CTLR;
    __IO uint32_t CMP3_CFGR;
    __IO uint32_t CMP3_SW;
    __IO uint32_t CMP_STATR;
} OPA_TypeDef;

/* PD Registers */
typedef struct
{
    union
    {
        __IO uint32_t USBPD_CONFIG;
        struct
        {
            __IO uint16_t CONFIG;
            __IO uint16_t BMC_CLK_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_CONTROL;
        struct
        {
            union
            {
                __IO uint16_t R16_CONTROL;
                struct
                {
                    __IO uint8_t  CONTROL;
                    __IO uint8_t  TX_SEL;
                };
            };
            __IO uint16_t BMC_TX_SZ;
        };
    };
    union
    {
        __IO uint32_t USBPD_STATUS;
        struct
        {
            union
            {
                __IO uint16_t R16_STATUS;
                struct
                {
                    __IO uint8_t  DATA_BUF;
                    __IO uint8_t  STATUS;
                };
            };
            __IO uint16_t BMC_BYTE_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_PORT;
        struct
        {
            __IO uint8_t PORT_CC1;
            __IO uint8_t RESERVED0;
            __IO uint8_t PORT_CC2;
            __IO uint8_t RESERVED1;
        };
    };
    union
    {
        __IO uint32_t USBPD_DMA;
        struct
        {
            __IO uint16_t DMA;
            __IO uint16_t RESERVED2;
        };
    };
} USBPD_TypeDef;

/* USBFS Registers */
typedef struct
{
    __IO uint8_t  BASE_CTRL;
    __IO uint8_t  UDEV_CTRL;
    __IO uint8_t  INT_EN;
    __IO uint8_t  DEV_ADDR;
    __IO uint8_t  Reserve0;
    __IO uint8_t  MIS_ST;
    __IO uint8_t  INT_FG;
    __IO uint8_t  INT_ST;
    __IO uint32_t RX_LEN;
    __IO uint8_t  UEP4_1_MOD;
    __IO uint8_t  UEP2_3_MOD;
    __IO uint8_t  UEP5_6_MOD;
    __IO uint8_t  UEP7_MOD;
    __IO uint32_t UEP0_DMA;
    __IO uint32_t UEP1_DMA;
    __IO uint32_t UEP2_DMA;
    __IO uint32_t UEP3_DMA;
    __IO uint32_t UEP4_DMA;
    __IO uint32_t UEP5_DMA;
    __IO uint32_t UEP6_DMA;
    __IO uint32_t UEP7_DMA;
    __IO uint16_t UEP0_TX_LEN;
    union{
        __IO uint16_t  UEP0_CTRL;
        struct{
            __IO uint8_t  UEP0_TX_CTRL;
            __IO uint8_t  UEP0_RX_CTRL;
        };
    };
    __IO uint16_t UEP1_TX_LEN;
    union{
        __IO uint16_t  UEP1_CTRL;
        struct{
            __IO uint8_t  UEP1_TX_CTRL;
            __IO uint8_t  UEP1_RX_CTRL;
        };
    };
    __IO uint16_t UEP2_TX_LEN;
    union{
        __IO uint16_t  UEP2_CTRL;
        struct{
            __IO uint8_t  UEP2_TX_CTRL;
            __IO uint8_t  UEP2_RX_CTRL;
        };
    };
    __IO uint16_t UEP3_TX_LEN;
    union{
        __IO uint16_t  UEP3_CTRL;
        struct{
            __IO uint8_t  UEP3_TX_CTRL;
            __IO uint8_t  UEP3_RX_CTRL;
        };
    };
    __IO uint16_t UEP4_TX_LEN;
    union{
        __IO uint16_t  UEP4_CTRL;
        struct{
            __IO uint8_t  UEP4_TX_CTRL;
            __IO uint8_t  UEP4_RX_CTRL;
        };
    };
    __IO uint16_t UEP5_TX_LEN;
    union{
        __IO uint16_t  UEP5_CTRL;
        struct{
            __IO uint8_t  UEP5_TX_CTRL;
            __IO uint8_t  UEP5_RX_CTRL;
        };
    };
    __IO uint16_t UEP6_TX_LEN;
    union{
        __IO uint16_t  UEP6_CTRL;
        struct{
            __IO uint8_t  UEP6_TX_CTRL;
            __IO uint8_t  UEP6_RX_CTRL;
        };
    };
    __IO uint16_t UEP7_TX_LEN;
    union{
        __IO uint16_t  UEP7_CTRL;
        struct{
            __IO uint8_t  UEP7_TX_CTRL;
            __IO uint8_t  UEP7_RX_CTRL;
        };
    };
    __IO uint32_t Reserve1;
    __IO uint32_t OTG_CR;
    __IO uint32_t OTG_SR;
} USBFSD_TypeDef;

typedef struct
{
    __IO uint8_t   BASE_CTRL;
    __IO uint8_t   HOST_CTRL;
    __IO uint8_t   INT_EN;
    __IO uint8_t   DEV_ADDR;
    __IO uint8_t   Reserve0;
    __IO uint8_t   MIS_ST;
    __IO uint8_t   INT_FG;
    __IO uint8_t   INT_ST;
    __IO uint16_t  RX_LEN;
    __IO uint16_t  Reserve1;
    __IO uint8_t   Reserve2;
    __IO uint8_t   HOST_EP_MOD;
    __IO uint16_t  Reserve3;
    __IO uint32_t  Reserve4;
    __IO uint32_t  Reserve5;
    __IO uint32_t  HOST_RX_DMA;
    __IO uint32_t  HOST_TX_DMA;
    __IO uint32_t  Reserve6;
    __IO uint32_t  Reserve7;
    __IO uint32_t  Reserve8;
    __IO uint32_t  Reserve9;
    __IO uint32_t  Reserve10;
    __IO uint16_t  Reserve11;
    __IO uint16_t  HOST_SETUP;
    __IO uint8_t   HOST_EP_PID;
    __IO uint8_t   Reserve12;
    __IO uint8_t   Reserve13;
    __IO uint8_t   HOST_RX_CTRL;
    __IO uint16_t  HOST_TX_LEN;
    __IO uint8_t   HOST_TX_CTRL;
    __IO uint8_t   Reserve14;
    __IO uint32_t  Reserve15;
    __IO uint32_t  Reserve16;
    __IO uint32_t  Reserve17;
    __IO uint32_t  Reserve18;
    __IO uint32_t  Reserve19;
    __IO uint32_t  OTG_CR;
    __IO uint32_t  OTG_SR;
} USBFSH_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

