openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
#define PB1PERIPH_BASE                          (PERIPH_BASE)
#define PB2PERIPH_BASE                          (PERIPH_BASE + 0x10000)
#define HBPERIPH_BASE                           (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (PB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (PB1PERIPH_BASE + 0x0400)
#define WWDG_BASE                               (PB1PERIPH_BASE + 0x2C00)
#define I2C1_BASE                               (PB1PERIPH_BASE + 0x5400)
#define PWR_BASE                                (PB1PERIPH_BASE + 0x7000)

#define AFIO_BASE                               (PB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (PB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (PB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (PB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (PB2PERIPH_BASE + 0x1000)
#define ADC1_BASE                               (PB2PERIPH_BASE + 0x2400)
#define TIM1_BASE                               (PB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (PB2PERIPH_BASE + 0x3000)
#define USART1_BASE                              (PB2PERIPH_BASE + 0x3800)

#define DMA1_BASE                               (HBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (HBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (HBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (HBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (HBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (HBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (HBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (HBPERIPH_BASE + 0x0080)
#define RCC_BASE                                (HBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE                            (HBPERIPH_BASE + 0x2000)
#define USBFS_BASE                              (HBPERIPH_BASE + 0x3400)
#define EXTEN_BASE                              (HBPERIPH_BASE + 0x3800)
#define USBPD0_BASE                             (HBPERIPH_BASE + 0x4000)
#define USBPD1_BASE                             (HBPERIPH_BASE + 0x4400)
#define OPA_BASE                                (HBPERIPH_BASE + 0x4800)

#define OB_BASE                                 ((uint32_t)0x1FFFF300)   /* Flash Option Bytes base address */
#define DBGMCU_BASE                             ((uint32_t)0xE000D000)

/* Peripheral declaration */
#define TIM2                                    ((TIM_TypeDef *)TIM2_BASE)
#define TIM3                                    ((TIM_TypeDef *)TIM3_BASE)
#define WWDG                                    ((WWDG_TypeDef *)WWDG_BASE)
#define I2C1                                    ((I2C_TypeDef *)I2C1_BASE)
#define PWR                                     ((PWR_TypeDef *)PWR_BASE)

#define AFIO                                    ((AFIO_TypeDef *)AFIO_BASE)
#define EXTI                                    ((EXTI_TypeDef *)EXTI_BASE)
#define GPIOA                                   ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                                   ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC                                   ((GPIO_TypeDef *)GPIOC_BASE)
#define ADC1                                    ((ADC_TypeDef *)ADC1_BASE)
#define TIM1                                    ((TIM_TypeDef *)TIM1_BASE)
#define SPI1                                    ((SPI_TypeDef *)SPI1_BASE)
#define USART1                                  ((USART_TypeDef *)USART1_BASE)

#define DMA1                                    ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1                           ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2                           ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3                           ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4                           ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5                           ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define DMA1_Channel6                           ((DMA_Channel_TypeDef *)DMA1_Channel6_BASE)
#define DMA1_Channel7                           ((DMA_Channel_TypeDef *)DMA1_Channel7_BASE)
#define RCC                                     ((RCC_TypeDef *)RCC_BASE)
#define FLASH                                   ((FLASH_TypeDef *)FLASH_R_BASE)
#define USBFSD                                  ((USBFSD_TypeDef *)USBFS_BASE)
#define USBFSH                                  ((USBFSH_TypeDef *)USBFS_BASE)
#define EXTEN                                   ((EXTEN_TypeDef *)EXTEN_BASE)
#define USBPD0                                  ((USBPD_TypeDef *)USBPD0_BASE)
#define USBPD1                                  ((USBPD_TypeDef *)USBPD1_BASE)
#define OPA                                     ((OPA_TypeDef *)OPA_BASE)

#define OB                                      ((OB_TypeDef *)OB_BASE)
#define DBGMCU                                  ((DBGMCU_TypeDef *)DBGMCU_BASE)

#define VENDOR_CFG0_BASE                        ((uint32_t)0x1FFFF390)
#define CFG0_ISINK_ADJ                          (VENDOR_CFG0_BASE)

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                        Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for ADC_STATR register  ********************/
#define ADC_AWD                                 ((uint16_t)0x0001) /* Analog watchdog flag */
#define ADC_EOC                                 ((uint16_t)0x0002) /* End of conversion */
#define ADC_JEOC                                ((uint16_t)0x0004) /* Injected channel end of conversion */
#define ADC_JSTRT                               ((uint16_t)0x0008) /* Injected channel Start flag */
#define ADC_STRT                                ((uint16_t)0x0010) /* Regular channel Start flag */
#define AWD_OVF                                 ((uint16_t)0x0020)
#define AWD_DNF                                 ((uint16_t)0x0040)
#define MULT_CMP3                               ((uint16_t)0x0080)
#define MULT_CMP2                               ((uint16_t)0x0100)
#define MULT_CMP1                               ((uint16_t)0x0200)

/*******************  Bit definition for ADC_CTLR1 register  ********************/
#define ADC_AWDCH                               ((uint32_t)0x0000001F) /* AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_AWDCH_0                             ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_AWDCH_1                             ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_AWDCH_2                             ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_AWDCH_3                             ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_AWDCH_4                             ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_EOCIE                               ((uint32_t)0x00000020) /* Interrupt enable for EOC */
#define ADC_AWDIE                               ((uint32_t)0x00000040) /* Analog Watchdog interrupt enable */
#define ADC_JEOCIE                              ((uint32_t)0x00000080) /* Interrupt enable for injected channels */
#define ADC_SCAN                                ((uint32_t)0x00000100) /* Scan mode */
#define ADC_AWDSGL                              ((uint32_t)0x00000200) /* Enable the watchdog on a single channel in scan mode */
#define ADC_JAUTO                               ((uint32_t)0x00000400) /* Automatic injected group conversion */
#define ADC_DISCEN                              ((uint32_t)0x00000800) /* Discontinuous mode on regular channels */
#define ADC_JDISCEN                             ((uint32_t)0x00001000) /* Discontinuous mode on injected channels */

#define ADC_DISCNUM                             ((uint32_t)0x0000E000) /* DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_DISCNUM_0                           ((uint32_t)0x00002000) /* Bit 0 */
#define ADC_DISCNUM_1                           ((uint32_t)0x00004000) /* Bit 1 */
#define ADC_DISCNUM_2                           ((uint32_t)0x00008000) /* Bit 2 */

#define ADC_JAWDEN                              ((uint32_t)0x00400000) /* Analog watchdog enable on injected channels */
#define ADC_AWDEN                               ((uint32_t)0x00800000) /* Analog watchdog enable on regular channels */
#define ADC_BUFFEN                              ((uint32_t)0x04000000)
#define ADC_AWD_OVFIE                           ((uint32_t)0x20000000)
#define ADC_AWD_DNFIE                           ((uint32_t)0x40000000)
#define ADC_MULT_CMPEN                          ((uint32_t)0x80000000)

