openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/*******************  Bit definition for ADC_CTLR2 register  ********************/
#define ADC_ADON                                ((uint32_t)0x00000001) /* A/D Converter ON / OFF */
#define ADC_CONT                                ((uint32_t)0x00000002) /* Continuous Conversion */
#define ADC_CAL                                 ((uint32_t)0x00000004) /* A/D Calibration */
#define ADC_RSTCAL                              ((uint32_t)0x00000008) /* Reset Calibration */
#define ADC_DMA                                 ((uint32_t)0x00000100) /* Direct Memory access mode */
#define ADC_ALIGN                               ((uint32_t)0x00000400) /* Data Alignment */

#define ADC_JEXTSEL                             ((uint32_t)0x00007800) /* JEXTSEL[3:0] bits (External event select for injected group) */
#define ADC_JEXTSEL_0                           ((uint32_t)0x00000800) /* Bit 0 */
#define ADC_JEXTSEL_1                           ((uint32_t)0x00001000) /* Bit 1 */
#define ADC_JEXTSEL_2                           ((uint32_t)0x00002000) /* Bit 2 */
#define ADC_JEXTSEL_3                           ((uint32_t)0x00004000) /* Bit 2 */

#define ADC_JEXTTRIG                            ((uint32_t)0x00008000) /* External Trigger Conversion mode for injected channels */

#define ADC_EXTSEL                              ((uint32_t)0x000F0000) /* EXTSEL[3:0] bits (External Event Select for regular group) */
#define ADC_EXTSEL_0                            ((uint32_t)0x00010000) /* Bit 0 */
#define ADC_EXTSEL_1                            ((uint32_t)0x00020000) /* Bit 1 */
#define ADC_EXTSEL_2                            ((uint32_t)0x00040000) /* Bit 2 */
#define ADC_EXTSEL_3                            ((uint32_t)0x00080000) /* Bit 2 */

#define ADC_EXTTRIG                             ((uint32_t)0x00100000) /* External Trigger Conversion mode for regular channels */
#define ADC_JSWSTART                            ((uint32_t)0x00200000) /* Start Conversion of injected channels */
#define ADC_SWSTART                             ((uint32_t)0x00400000) /* Start Conversion of regular channels */

/******************  Bit definition for ADC_SAMPTR1 register  *******************/

#define ADC_SMP16                               ((uint32_t)0x00000003) /* SMP16[1:0] bits (Channel 16 Sample time selection) */
#define ADC_SMP16_0                             ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_SMP16_1                             ((uint32_t)0x00000002) /* Bit 1 */

#define ADC_SMP17                               ((uint32_t)0x0000000C) /* SMP17[1:0] bits (Channel 17 Sample time selection) */
#define ADC_SMP17_0                             ((uint32_t)0x00000004) /* Bit 0 */
#define ADC_SMP17_1                             ((uint32_t)0x00000008) /* Bit 1 */

#define ADC_SMP18                               ((uint32_t)0x00000030) /* SMP18[1:0] bits (Channel 18 Sample time selection) */
#define ADC_SMP18_0                             ((uint32_t)0x00000010) /* Bit 0 */
#define ADC_SMP18_1                             ((uint32_t)0x00000020) /* Bit 1 */

#define ADC_SMP19                               ((uint32_t)0x000000C0) /* SMP19[1:0] bits (Channel 19 Sample time selection) */
#define ADC_SMP19_0                             ((uint32_t)0x00000040) /* Bit 0 */
#define ADC_SMP19_1                             ((uint32_t)0x00000080) /* Bit 1 */

/******************  Bit definition for ADC_SAMPTR2 register  *******************/
#define ADC_SMP0                                ((uint32_t)0x00000003) /* SMP0[2:0] bits (Channel 0 Sample time selection) */
#define ADC_SMP0_0                              ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_SMP0_1                              ((uint32_t)0x00000002) /* Bit 1 */

#define ADC_SMP1                                ((uint32_t)0x0000000C) /* SMP1[2:0] bits (Channel 1 Sample time selection) */
#define ADC_SMP1_0                              ((uint32_t)0x00000004) /* Bit 0 */
#define ADC_SMP1_1                              ((uint32_t)0x00000008) /* Bit 1 */

#define ADC_SMP2                                ((uint32_t)0x00000030) /* SMP2[2:0] bits (Channel 2 Sample time selection) */
#define ADC_SMP2_0                              ((uint32_t)0x00000010) /* Bit 0 */
#define ADC_SMP2_1                              ((uint32_t)0x00000020) /* Bit 1 */

#define ADC_SMP3                                ((uint32_t)0x000000C0) /* SMP3[2:0] bits (Channel 3 Sample time selection) */
#define ADC_SMP3_0                              ((uint32_t)0x00000040) /* Bit 0 */
#define ADC_SMP3_1                              ((uint32_t)0x00000080) /* Bit 1 */

#define ADC_SMP4                                ((uint32_t)0x00000300) /* SMP4[2:0] bits (Channel 4 Sample time selection) */
#define ADC_SMP4_0                              ((uint32_t)0x00000100) /* Bit 0 */
#define ADC_SMP4_1                              ((uint32_t)0x00000200) /* Bit 1 */

#define ADC_SMP5                                ((uint32_t)0x00000C00) /* SMP5[2:0] bits (Channel 5 Sample time selection) */
#define ADC_SMP5_0                              ((uint32_t)0x00000400) /* Bit 0 */
#define ADC_SMP5_1                              ((uint32_t)0x00000800) /* Bit 1 */

#define ADC_SMP6                                ((uint32_t)0x00003000) /* SMP6[2:0] bits (Channel 6 Sample time selection) */
#define ADC_SMP6_0                              ((uint32_t)0x00001000) /* Bit 0 */
#define ADC_SMP6_1                              ((uint32_t)0x00002000) /* Bit 1 */

#define ADC_SMP7                                ((uint32_t)0x0000C000) /* SMP7[2:0] bits (Channel 7 Sample time selection) */
#define ADC_SMP7_0                              ((uint32_t)0x00004000) /* Bit 0 */
#define ADC_SMP7_1                              ((uint32_t)0x00008000) /* Bit 1 */

#define ADC_SMP8                                ((uint32_t)0x00030000) /* SMP8[2:0] bits (Channel 8 Sample time selection) */
#define ADC_SMP8_0                              ((uint32_t)0x00010000) /* Bit 0 */
#define ADC_SMP8_1                              ((uint32_t)0x00020000) /* Bit 1 */

