openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/*******************  Bit definition for TIM_DTCR register  *******************/
#define TIM_OC1N_EN                             ((uint16_t)0x0001)
#define TIM_OC2N_EN                             ((uint16_t)0x0002)
#define TIM_DT1_P                               ((uint16_t)0x0004)
#define TIM_DT1N_P                              ((uint16_t)0x0008)
#define TIM_DT2_P                               ((uint16_t)0x0010)
#define TIM_DT2N_P                              ((uint16_t)0x0020)
#define TIM_TIM2_DT_DIV                         ((uint16_t)0x0040)

#define TIM_DT1                                 ((uint16_t)0x0F00) /* DT1[3:0] TIM2 Channel 1 Dead Time Configuration */
#define TIM_DT1_0                               ((uint16_t)0x0100) /* Bit 0 */
#define TIM_DT1_1                               ((uint16_t)0x0200) /* Bit 1 */
#define TIM_DT1_2                               ((uint16_t)0x0400) /* Bit 2 */
#define TIM_DT1_3                               ((uint16_t)0x0800) /* Bit 3 */

#define TIM_DT2                                 ((uint16_t)0xF000) /* DT2[3:0] TIM2 Channel 2 Dead Time Configuration */
#define TIM_DT2_0                               ((uint16_t)0x1000) /* Bit 0 */
#define TIM_DT2_1                               ((uint16_t)0x2000) /* Bit 1 */
#define TIM_DT2_2                               ((uint16_t)0x4000) /* Bit 2 */
#define TIM_DT2_3                               ((uint16_t)0x8000) /* Bit 3 */

/*******************  Bit definition for TIM_DMACFGR register  ********************/
#define TIM_DBA                                 ((uint16_t)0x001F) /* DBA[4:0] bits (DMA Base Address) */
#define TIM_DBA_0                               ((uint16_t)0x0001) /* Bit 0 */
#define TIM_DBA_1                               ((uint16_t)0x0002) /* Bit 1 */
#define TIM_DBA_2                               ((uint16_t)0x0004) /* Bit 2 */
#define TIM_DBA_3                               ((uint16_t)0x0008) /* Bit 3 */
#define TIM_DBA_4                               ((uint16_t)0x0010) /* Bit 4 */

#define TIM_DBL                                 ((uint16_t)0x1F00) /* DBL[4:0] bits (DMA Burst Length) */
#define TIM_DBL_0                               ((uint16_t)0x0100) /* Bit 0 */
#define TIM_DBL_1                               ((uint16_t)0x0200) /* Bit 1 */
#define TIM_DBL_2                               ((uint16_t)0x0400) /* Bit 2 */
#define TIM_DBL_3                               ((uint16_t)0x0800) /* Bit 3 */
#define TIM_DBL_4                               ((uint16_t)0x1000) /* Bit 4 */

/*******************  Bit definition for TIM_DMAADR register  *******************/
#define TIM_DMAR_DMAB                           ((uint16_t)0xFFFF) /* DMA register for burst accesses */

/*******************  Bit definition for TIM_AUX1 register  *******************/
#define TIM_CAP_ED_CH2                          ((uint16_t)0x0001)
#define TIM_CAP_ED_CH3                          ((uint16_t)0x0002)
#define TIM_CAP_ED_CH4                          ((uint16_t)0x0004)
#define TIM_CMS_SPEC                            ((uint16_t)0x0008)

#define TIM_OC5PE                               ((uint16_t)0x0020)
#define TIM_OC6PE                               ((uint16_t)0x0040)
#define TIM_OC7PE                               ((uint16_t)0x0080)
#define TIM_OC8PE                               ((uint16_t)0x0100)

#define TIM_CC5DE                               ((uint16_t)0x0200)
#define TIM_TIM1_ADC_CAP                        ((uint16_t)0x0400)
#define TIM_CC1N_SPEC_EN                        ((uint16_t)0x0800)
#define TIM_CC2N_SPEC_EN                        ((uint16_t)0x1000)
#define TIM_CC3N_SPEC_EN                        ((uint16_t)0x2000)

#define TIM_TIM1_HSCK_MODE                      ((uint16_t)0x0800)

/*******************  Bit definition for TIM_AUX2 register  *******************/
#define TIM_DT_VLU2                             ((uint16_t)0x00FF) /* DT_VLU2[7:0] bits*/
#define TIM_DT_VLU2_0                           ((uint16_t)0x0001) /* Bit 0 */
#define TIM_DT_VLU2_1                           ((uint16_t)0x0002) /* Bit 1 */
#define TIM_DT_VLU2_2                           ((uint16_t)0x0004) /* Bit 2 */
#define TIM_DT_VLU2_3                           ((uint16_t)0x0008) /* Bit 3 */
#define TIM_DT_VLU2_4                           ((uint16_t)0x0010) /* Bit 4 */
#define TIM_DT_VLU2_5                           ((uint16_t)0x0020) /* Bit 5 */
#define TIM_DT_VLU2_6                           ((uint16_t)0x0040) /* Bit 6 */
#define TIM_DT_VLU2_7                           ((uint16_t)0x0080) /* Bit 7 */

#define TIM_DTP_MODE                            ((uint16_t)0x0100)
#define TIM_DTN_MODE                            ((uint16_t)0x0200)

#define TIM_OC5M                                ((uint16_t)0x0400)
#define TIM_OC5CE                               ((uint16_t)0x0800)
#define TIM_OC1NM                               ((uint16_t)0x1000)
#define TIM_OC2NM                               ((uint16_t)0x2000)
#define TIM_OC3NM                               ((uint16_t)0x4000)
#define TIM_CC5P                                ((uint16_t)0x8000)

/*******************  Bit definition for TIM_CH5CVR register  *******************/
#define TIM_CCR5                                ((uint16_t)0xFFFF)

/*******************  Bit definition for TIM_CH6CVR register  *******************/
#define TIM_CCR6                                ((uint16_t)0xFFFF)

/*******************  Bit definition for TIM_CH7CVR register  *******************/
#define TIM_CCR7                                ((uint16_t)0xFFFF)

/*******************  Bit definition for TIM_CH8CVR register  *******************/
#define TIM_CCR8                                ((uint16_t)0xFFFF)

/******************************************************************************/
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/******************************************************************************/

/*******************  Bit definition for UART_STATR register  *******************/
#define UART_STATR_PE                          ((uint16_t)0x0001) /* Parity Error */
#define UART_STATR_FE                          ((uint16_t)0x0002) /* Framing Error */
#define UART_STATR_NE                          ((uint16_t)0x0004) /* Noise Error Flag */
#define UART_STATR_ORE                         ((uint16_t)0x0008) /* OverRun Error */
#define UART_STATR_IDLE                        ((uint16_t)0x0010) /* IDLE line detected */
#define UART_STATR_RXNE                        ((uint16_t)0x0020) /* Read Data Register Not Empty */
#define UART_STATR_TC                          ((uint16_t)0x0040) /* Transmission Complete */
#define UART_STATR_TXE                         ((uint16_t)0x0080) /* Transmit Data Register Empty */
#define UART_STATR_LBD                         ((uint16_t)0x0100) /* LIN Break Detection Flag */
#define UART_STATR_CTS                         ((uint16_t)0x0200) /* CTS Flag */
#define UART_STATR_RX_BUSY                     ((uint16_t)0x0400)

/*******************  Bit definition for UART_DATAR register  *******************/
#define UART_DATAR_DR                          ((uint16_t)0x01FF) /* Data value */

/******************  Bit definition for UART_BRR register  *******************/
#define UART_BRR_DIV_Fraction                  ((uint16_t)0x000F) /* Fraction of UARTDIV */
#define UART_BRR_DIV_Mantissa                  ((uint16_t)0xFFF0) /* Mantissa of UARTDIV */

/******************  Bit definition for UART_CTLR1 register  *******************/
#define UART_CTLR1_SBK                         ((uint16_t)0x0001) /* Send Break */
#define UART_CTLR1_RWU                         ((uint16_t)0x0002) /* Receiver wakeup */
#define UART_CTLR1_RE                          ((uint16_t)0x0004) /* Receiver Enable */
#define UART_CTLR1_TE                          ((uint16_t)0x0008) /* Transmitter Enable */
#define UART_CTLR1_IDLEIE                      ((uint16_t)0x0010) /* IDLE Interrupt Enable */
#define UART_CTLR1_RXNEIE                      ((uint16_t)0x0020) /* RXNE Interrupt Enable */
#define UART_CTLR1_TCIE                        ((uint16_t)0x0040) /* Transmission Complete Interrupt Enable */
#define UART_CTLR1_TXEIE                       ((uint16_t)0x0080) /* PE Interrupt Enable */
#define UART_CTLR1_PEIE                        ((uint16_t)0x0100) /* PE Interrupt Enable */
#define UART_CTLR1_PS                          ((uint16_t)0x0200) /* Parity Selection */
#define UART_CTLR1_PCE                         ((uint16_t)0x0400) /* Parity Control Enable */
#define UART_CTLR1_WAKE                        ((uint16_t)0x0800) /* Wakeup method */
#define UART_CTLR1_M                           ((uint16_t)0x1000) /* Word length */
#define UART_CTLR1_UE                          ((uint16_t)0x2000) /* UART Enable */

