openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/******************  Bit definition for UART_CTLR2 register  *******************/
#define UART_CTLR2_ADD                         ((uint16_t)0x000F) /* Address of the UART node */
#define UART_CTLR2_LBDL                        ((uint16_t)0x0020) /* LIN Break Detection Length */
#define UART_CTLR2_LBDIE                       ((uint16_t)0x0040) /* LIN Break Detection Interrupt Enable */

#define UART_CTLR2_STOP                        ((uint16_t)0x3000) /* STOP[1:0] bits (STOP bits) */
#define UART_CTLR2_STOP_0                      ((uint16_t)0x1000) /* Bit 0 */
#define UART_CTLR2_STOP_1                      ((uint16_t)0x2000) /* Bit 1 */

#define UART_CTLR2_LINEN                       ((uint16_t)0x4000) /* LIN mode enable */

/******************  Bit definition for UART_CTLR3 register  *******************/
#define UART_CTLR3_EIE                         ((uint16_t)0x0001) /* Error Interrupt Enable */
#define UART_CTLR3_IREN                        ((uint16_t)0x0002) /* IrDA mode Enable */
#define UART_CTLR3_IRLP                        ((uint16_t)0x0004) /* IrDA Low-Power */
#define UART_CTLR3_HDSEL                       ((uint16_t)0x0008) /* Half-Duplex Selection */

#define UART_CTLR3_DMAR                        ((uint16_t)0x0040) /* DMA Enable Receiver */
#define UART_CTLR3_DMAT                        ((uint16_t)0x0080) /* DMA Enable Transmitter */
#define UART_CTLR3_RTSE                        ((uint16_t)0x0100) /* RTS Enable */
#define UART_CTLR3_CTSE                        ((uint16_t)0x0200) /* CTS Enable */
#define UART_CTLR3_CTSIE                       ((uint16_t)0x0400) /* CTS Interrupt Enable */

/******************  Bit definition for UART_GPR register  ******************/
#define UART_GPR_PSC                           ((uint16_t)0x00FF) /* PSC[7:0] bits (Prescaler value) */
#define UART_GPR_PSC_0                         ((uint16_t)0x0001) /* Bit 0 */
#define UART_GPR_PSC_1                         ((uint16_t)0x0002) /* Bit 1 */
#define UART_GPR_PSC_2                         ((uint16_t)0x0004) /* Bit 2 */
#define UART_GPR_PSC_3                         ((uint16_t)0x0008) /* Bit 3 */
#define UART_GPR_PSC_4                         ((uint16_t)0x0010) /* Bit 4 */
#define UART_GPR_PSC_5                         ((uint16_t)0x0020) /* Bit 5 */
#define UART_GPR_PSC_6                         ((uint16_t)0x0040) /* Bit 6 */
#define UART_GPR_PSC_7                         ((uint16_t)0x0080) /* Bit 7 */

/******************************************************************************/
/*                            Window WATCHDOG                                 */
/******************************************************************************/

/*******************  Bit definition for WWDG_CTLR register  ********************/
#define WWDG_CTLR_T                             ((uint8_t)0x7F) /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CTLR_T0                            ((uint8_t)0x01) /* Bit 0 */
#define WWDG_CTLR_T1                            ((uint8_t)0x02) /* Bit 1 */
#define WWDG_CTLR_T2                            ((uint8_t)0x04) /* Bit 2 */
#define WWDG_CTLR_T3                            ((uint8_t)0x08) /* Bit 3 */
#define WWDG_CTLR_T4                            ((uint8_t)0x10) /* Bit 4 */
#define WWDG_CTLR_T5                            ((uint8_t)0x20) /* Bit 5 */
#define WWDG_CTLR_T6                            ((uint8_t)0x40) /* Bit 6 */

#define WWDG_CTLR_WDGA                          ((uint8_t)0x80) /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define WWDG_CFGR_W                             ((uint16_t)0x007F) /* W[6:0] bits (7-bit window value) */
#define WWDG_CFGR_W0                            ((uint16_t)0x0001) /* Bit 0 */
#define WWDG_CFGR_W1                            ((uint16_t)0x0002) /* Bit 1 */
#define WWDG_CFGR_W2                            ((uint16_t)0x0004) /* Bit 2 */
#define WWDG_CFGR_W3                            ((uint16_t)0x0008) /* Bit 3 */
#define WWDG_CFGR_W4                            ((uint16_t)0x0010) /* Bit 4 */
#define WWDG_CFGR_W5                            ((uint16_t)0x0020) /* Bit 5 */
#define WWDG_CFGR_W6                            ((uint16_t)0x0040) /* Bit 6 */

#define WWDG_CFGR_WDGTB                         ((uint16_t)0x0180) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFGR_WDGTB0                        ((uint16_t)0x0080) /* Bit 0 */
#define WWDG_CFGR_WDGTB1                        ((uint16_t)0x0100) /* Bit 1 */

#define WWDG_CFGR_EWI                           ((uint16_t)0x0200) /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define WWDG_STATR_EWIF                         ((uint8_t)0x01) /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                           OPA FUNNCTION                                    */
/******************************************************************************/

/*******************  Bit definition for QII_CFGR register  *******************/
#define QII_CFGR_QII1_AE                        ((uint32_t)0x00000001)
#define QII_CFGR_QII1_HYPSEL                    ((uint32_t)0x00000002)
#define QII_CFGR_QII1_AVSEL                     ((uint32_t)0x00000004)
#define QII_CFGR_QII2_AE                        ((uint32_t)0x00000008)
#define QII_CFGR_QII2_OPAEN                     ((uint32_t)0x00000010)
#define QII_CFGR_QII2_SESEL                     ((uint32_t)0x00000020)

#define QII_CFGR_QII2_AVSEL                     ((uint32_t)0x000000C0) /* QII2_AVSEL[1:0] bits*/
#define QII_CFGR_QII2_AVSEL_0                   ((uint32_t)0x00000040)
#define QII_CFGR_QII2_AVSEL_1                   ((uint32_t)0x00000080)

#define QII_CFGR_QII2_HYPSEL                    ((uint32_t)0x00000700) /* QII2_HYPSEL[2:0] bits*/
#define QII_CFGR_QII2_HYPSEL_0                  ((uint32_t)0x00000100)
#define QII_CFGR_QII2_HYPSEL_1                  ((uint32_t)0x00000200)
#define QII_CFGR_QII2_HYPSEL_2                  ((uint32_t)0x00000400)

#define QII_CFGR_QII2_DACEN                     ((uint32_t)0x00001000)

#define QII_CFGR_QII2_DAC                       ((uint32_t)0x0001E000) /* QII2_DAC[3:0] bits*/
#define QII_CFGR_QII2_DAC_0                     ((uint32_t)0x00002000)
#define QII_CFGR_QII2_DAC_1                     ((uint32_t)0x00004000)
#define QII_CFGR_QII2_DAC_2                     ((uint32_t)0x00008000)
#define QII_CFGR_QII2_DAC_3                     ((uint32_t)0x00010000)

#define QII_CFGR_QII2_CHNSEL                    ((uint32_t)0x000C0000) /* QII2_CHNSEL[1:2] bits*/
#define QII_CFGR_QII2_CHNSEL_0                  ((uint32_t)0x00040000)
#define QII_CFGR_QII2_CHNSEL_1                  ((uint32_t)0x00080000)

