openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
#define QII_CFGR_QII2_CHPSEL                    ((uint32_t)0x00300000) /* QII2_CHPSEL[1:2] bits*/
#define QII_CFGR_QII2_CHPSEL_0                  ((uint32_t)0x00100000)
#define QII_CFGR_QII2_CHPSEL_1                  ((uint32_t)0x00200000)

/*******************  Bit definition for ISP_CTLR register  *******************/
#define ISP_CTLR_ISP1_EN                        ((uint32_t)0x00000001)

#define ISP_CTLR_ISP1_GAIN                      ((uint32_t)0x00000006) /* ISP1_GAIN [1:0] bits*/
#define ISP_CTLR_ISP1_GAIN_0                    ((uint32_t)0x00000002)
#define ISP_CTLR_ISP1_GAIN_1                    ((uint32_t)0x00000004)

#define ISP_CTLR_ISP1_VFBIAS                    ((uint32_t)0x00000008)
#define ISP_CTLR_ISP1_NSEL                      ((uint32_t)0x00000010)
#define ISP_CTLR_ISP1_SEL_IO                    ((uint32_t)0x00000020)
#define ISP_CTLR_ISP1_QDET1_EN                  ((uint32_t)0x00000040)
#define ISP_CTLR_ISP1_QDET1_PD30K               ((uint32_t)0x00000080)
#define ISP_CTLR_ISP1_QDET1_VBSEL               ((uint32_t)0x00000100)

#define ISP_CTLR_ISP2_EN                        ((uint32_t)0x00010000)

#define ISP_CTLR_ISP2_GAIN                      ((uint32_t)0x00060000) /* ISP2_GAIN [1:0] bits*/
#define ISP_CTLR_ISP2_GAIN_0                    ((uint32_t)0x00020000)
#define ISP_CTLR_ISP2_GAIN_1                    ((uint32_t)0x00040000)

#define ISP_CTLR_ISP2_VFBIAS                    ((uint32_t)0x00080000)
#define ISP_CTLR_ISP2_NSEL                      ((uint32_t)0x00100000)
#define ISP_CTLR_ISP2_SEL_IO                    ((uint32_t)0x00200000)
#define ISP_CTLR_ISP2_QDET1_EN                  ((uint32_t)0x00400000)
#define ISP_CTLR_ISP2_QDET1_PD30K               ((uint32_t)0x00800000)
#define ISP_CTLR_ISP2_QDET1_VBSEL               ((uint32_t)0x01000000)

/*******************  Bit definition for CMP_CTLR register  *******************/
#define CMP_CTLR_CMP1_FILT_EN                   ((uint32_t)0x00000001)

#define CMP_CTLR_CMP1_FILT_CFG                  ((uint32_t)0x0000003E) /* CMP1_FILT_CFG[4:0] bits*/
#define CMP_CTLR_CMP1_FILT_CFG_0                ((uint32_t)0x00000002)
#define CMP_CTLR_CMP1_FILT_CFG_1                ((uint32_t)0x00000004)
#define CMP_CTLR_CMP1_FILT_CFG_2                ((uint32_t)0x00000008)
#define CMP_CTLR_CMP1_FILT_CFG_3                ((uint32_t)0x00000010)
#define CMP_CTLR_CMP1_FILT_CFG_4                ((uint32_t)0x00000020)

#define CMP_CTLR_CMP2_FILT_EN                   ((uint32_t)0x00000040)

#define CMP_CTLR_CMP2_FILT_CFG                  ((uint32_t)0x00000F80) /* CMP2_FILT_CFG[4:0] bits*/
#define CMP_CTLR_CMP2_FILT_CFG_0                ((uint32_t)0x00000080)
#define CMP_CTLR_CMP2_FILT_CFG_1                ((uint32_t)0x00000100)
#define CMP_CTLR_CMP2_FILT_CFG_2                ((uint32_t)0x00000200)
#define CMP_CTLR_CMP2_FILT_CFG_3                ((uint32_t)0x00000400)
#define CMP_CTLR_CMP2_FILT_CFG_4                ((uint32_t)0x00000800)

#define CMP_CTLR_CMP2_BK_EN                     ((uint32_t)0x00001000)
#define CMP_CTLR_CMP2_INT_EN                    ((uint32_t)0x00002000)

#define CMP_CTLR_CMP3_TRG_SRC                   ((uint32_t)0x0001C000) /* CMP3_TRG_SRC[2:0] bits*/
#define CMP_CTLR_CMP3_TRG_SRC_0                 ((uint32_t)0x00004000)
#define CMP_CTLR_CMP3_TRG_SRC_1                 ((uint32_t)0x00008000)
#define CMP_CTLR_CMP3_TRG_SRC_2                 ((uint32_t)0x00010000)

#define CMP_CTLR_CMP3_TRG_GATE                  ((uint32_t)0x00020000)
#define CMP_CTLR_QII_CAP_EN                     ((uint32_t)0x00040000)
#define CMP_CTLR_CMP3_COM_MODE                  ((uint32_t)0x00080000)
#define CMP_CTLR_CMP3_FILT_EN                   ((uint32_t)0x00100000)

#define CMP_CTLR_CMP3_FILT_CFG                  ((uint32_t)0x03E00000) /* CMP3_FILT_CFG[4:0] bits*/
#define CMP_CTLR_CMP3_FILT_CFG_0                ((uint32_t)0x00200000)
#define CMP_CTLR_CMP3_FILT_CFG_1                ((uint32_t)0x00400000)
#define CMP_CTLR_CMP3_FILT_CFG_2                ((uint32_t)0x00800000)
#define CMP_CTLR_CMP3_FILT_CFG_3                ((uint32_t)0x01000000)
#define CMP_CTLR_CMP3_FILT_CFG_4                ((uint32_t)0x02000000)

#define CMP_CTLR_CMP3_BK_EN                     ((uint32_t)0x04000000)
#define CMP_CTLR_CMP3_INT_EN                    ((uint32_t)0x08000000)
#define CMP_CTLR_CMP2_TO_IO                     ((uint32_t)0x10000000)
#define CMP_CTLR_CMP1_TO_IO                     ((uint32_t)0x20000000)
#define CMP_CTLR_CMP3_CAP                       ((uint32_t)0x40000000)

/*******************  Bit definition for CMP3_CFGR register  *******************/
#define CMP_CTLR_CMP3_EN                        ((uint32_t)0x00000001)

#define CMP_CTLR_CMP3_PSEL                      ((uint32_t)0x0000000E) /* CMP3_PSEL[2:0] bits*/
#define CMP_CTLR_CMP3_PSEL_0                    ((uint32_t)0x00000002)
#define CMP_CTLR_CMP3_PSEL_1                    ((uint32_t)0x00000004)
#define CMP_CTLR_CMP3_PSEL_2                    ((uint32_t)0x00000008)

#define CMP_CTLR_CMP3_NSEL                      ((uint32_t)0x00000070) /* CMP3_NSEL[2:0] bits*/
#define CMP_CTLR_CMP3_NSEL_0                    ((uint32_t)0x00000010)
#define CMP_CTLR_CMP3_NSEL_1                    ((uint32_t)0x00000020)
#define CMP_CTLR_CMP3_NSEL_2                    ((uint32_t)0x00000040)

#define CMP_CTLR_CMP3_HYS                       ((uint32_t)0x00000180) /* CMP3_HYS[1:0] bits*/
#define CMP_CTLR_CMP3_HYS_0                     ((uint32_t)0x00000080)
#define CMP_CTLR_CMP3_HYS_1                     ((uint32_t)0x00000100)

#define CMP_CTLR_CMP3_RMID                      ((uint32_t)0x00000200)

#define CMP_CTLR_CMP3_DACDAT                    ((uint32_t)0x00003C00) /* DACAT[3:0]*/
#define CMP_CTLR_CMP3_DACDAT_0                  ((uint32_t)0x00000400)
#define CMP_CTLR_CMP3_DACDAT_1                  ((uint32_t)0x00000800)
#define CMP_CTLR_CMP3_DACDAT_2                  ((uint32_t)0x00001000)
#define CMP_CTLR_CMP3_DACDAT_3                  ((uint32_t)0x00002000)

#define CMP_CTLR_CMP3_OEN                       ((uint32_t)0x00004000)
#define CMP_CTLR_CMP3_OE                        ((uint32_t)0x00008000)
#define CMP_CTLR_CMP3_MODE_IOSEL                ((uint32_t)0x00010000)

