openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030.h
/*******************  Bit definition for CMP3_SW register  *******************/
#define CMP3_SW_CH_NUM                          ((uint32_t)0x00000003) /* CH_NUM[1:0] bits*/
#define CMP3_SW_CH_NUM_0                        ((uint32_t)0x00000001)
#define CMP3_SW_CH_NUM_1                        ((uint32_t)0x00000002)

#define CMP3_SW_OUT_POL_CH1                     ((uint32_t)0x00000004)
#define CMP3_SW_OUT_POL_CH2                     ((uint32_t)0x00000008)
#define CMP3_SW_OUT_POL_CH3                     ((uint32_t)0x00000010)
#define CMP3_SW_OUT_POL_CH4                     ((uint32_t)0x00000020)

/*******************  Bit definition for CMP_STATR register  *******************/
#define CMP_STATR_CMP1_OUT                      ((uint32_t)0x00000001)
#define CMP_STATR_CMP1_OUT_FILT                 ((uint32_t)0x00000002)
#define CMP_STATR_CMP2_OUT                      ((uint32_t)0x00000100)
#define CMP_STATR_CMP2_OUT_FILT                 ((uint32_t)0x00000200)

#define CMP_STATR_CMP2_COMIF                    ((uint32_t)0x00000400)
#define CMP_STATR_CMP3_OUT                      ((uint32_t)0x00010000)
#define CMP_STATR_CMP3_OUT_FILT                 ((uint32_t)0x00020000)

#define CMP_STATR_CMP3_CHOUT0                   ((uint32_t)0x00040000)
#define CMP_STATR_CMP3_CHOUT1                   ((uint32_t)0x00080000)
#define CMP_STATR_CMP3_CHOUT2                   ((uint32_t)0x00100000)
#define CMP_STATR_CMP3_CHOUT3                   ((uint32_t)0x00200000)

/******************************************************************************/
/*                          ENHANCED FUNNCTION                                */
/******************************************************************************/

/*******************  Bit definition for EXTEN_CTLR0 register  *******************/
#define EXTEN_LKUPEN                            ((uint32_t)0x00000040)
#define EXTEN_LKUPRST                           ((uint32_t)0x00000080)

#define EXTEN_USBPD0_CC_REF                     ((uint32_t)0x00010000)
#define EXTEN_USBPD1_CC_REF                     ((uint32_t)0x00020000)
#define EXTEN_USBPD0_CC_HVT                     ((uint32_t)0x00040000)
#define EXTEN_USBPD1_CC_HVT                     ((uint32_t)0x00080000)

#define EXTEN_USBPD0_LVE_T                      ((uint32_t)0x00300000) /* USBPD0_LVE_T[1:0] bits*/
#define EXTEN_USBPD0_LVE_T_0                    ((uint32_t)0x00100000)
#define EXTEN_USBPD0_LVE_T_1                    ((uint32_t)0x00200000)

#define EXTEN_USBPD1_LVE_T                      ((uint32_t)0x00C00000) /* USBPD1_LVE_T[1:0] bits*/
#define EXTEN_USBPD1_LVE_T_0                    ((uint32_t)0x00400000)
#define EXTEN_USBPD1_LVE_T_1                    ((uint32_t)0x00800000)

#define EXTEN_ISR_C1_EN                         ((uint32_t)0x01000000)
#define EXTEN_ISR_C1_SEL                        ((uint32_t)0x02000000)
#define EXTEN_ISR_C2_EN                         ((uint32_t)0x04000000)
#define EXTEN_ISR_C2_SEL                        ((uint32_t)0x08000000)

/*******************  Bit definition for EXTEN_KEYR register  *******************/
#define EXTEN_KEY_R                             ((uint32_t)0xFFFFFFFF)
#define EXTEN_KEY1                              ((uint32_t)0x45670123)
#define EXTEN_KEY2                              ((uint32_t)0xCDEF89AB)

/*******************  Bit definition for EXTEN_CTLR1 register  *******************/
#define EXTEN_UDP_BUFOE                         ((uint32_t)0x00000001)

#define EXTEN_UDP_PCS                           ((uint32_t)0x00000006) /* UDP_PCS[1:0] bits*/
#define EXTEN_UDP_PCS_0                         ((uint32_t)0x00000002)
#define EXTEN_UDP_PCS_1                         ((uint32_t)0x00000004)

#define EXTEN_UDP_PUE                           ((uint32_t)0x00000008)
#define EXTEN_UDP_PDE                           ((uint32_t)0x00000010)

#define EXTEN_UDP_DAC                           ((uint32_t)0x000007E0) /* UDP_DAC[5:0] bits*/
#define EXTEN_UDP_DAC_0                         ((uint32_t)0x00000020)
#define EXTEN_UDP_DAC_1                         ((uint32_t)0x00000040)
#define EXTEN_UDP_DAC_2                         ((uint32_t)0x00000080)
#define EXTEN_UDP_DAC_3                         ((uint32_t)0x00000100)
#define EXTEN_UDP_DAC_4                         ((uint32_t)0x00000200)
#define EXTEN_UDP_DAC_5                         ((uint32_t)0x00000400)

#define EXTEN_UDP_AE                            ((uint32_t)0x00000800)
#define EXTEN_UDP_AI                            ((uint32_t)0x00001000)
#define EXTEN_UDP_RAT                           ((uint32_t)0x00002000)
#define EXTEN_UDP_IE                            ((uint32_t)0x00004000)

#define EXTEN_UDM_BUFOE                         ((uint32_t)0x00010000)

#define EXTEN_UDM_PCS                           ((uint32_t)0x00060000) /* UDM_PCS[1:0] bits*/
#define EXTEN_UDM_PCS_0                         ((uint32_t)0x00020000)
#define EXTEN_UDM_PCS_1                         ((uint32_t)0x00040000)

#define EXTEN_UDM_PUE                           ((uint32_t)0x00080000)
#define EXTEN_UDM_PDE                           ((uint32_t)0x00100000)

#define EXTEN_UDM_DAC                           ((uint32_t)0x07E00000) /* UDM_DAC[5:0] bits*/
#define EXTEN_UDM_DAC_0                         ((uint32_t)0x00200000)
#define EXTEN_UDM_DAC_1                         ((uint32_t)0x00400000)
#define EXTEN_UDM_DAC_2                         ((uint32_t)0x00800000)
#define EXTEN_UDM_DAC_3                         ((uint32_t)0x01000000)
#define EXTEN_UDM_DAC_4                         ((uint32_t)0x02000000)
#define EXTEN_UDM_DAC_5                         ((uint32_t)0x04000000)

#define EXTEN_UDM_AE                            ((uint32_t)0x08000000)
#define EXTEN_UDM_AI                            ((uint32_t)0x10000000)
#define EXTEN_UDM_RAT                           ((uint32_t)0x20000000)
#define EXTEN_UDM_IE                            ((uint32_t)0x40000000)

#define EXTEN_UDU_SHRT                          ((uint32_t)0x80000000)

/*******************  Bit definition for EXTEN_CTLR2 register  *******************/
#define EXTEN_ISINK1_ADJ                        ((uint32_t)0x0000003F) /* ISINK1_ADJ[5:0] bits*/
#define EXTEN_ISINK1_ADJ_0                      ((uint32_t)0x00000001)
#define EXTEN_ISINK1_ADJ_1                      ((uint32_t)0x00000002)
#define EXTEN_ISINK1_ADJ_2                      ((uint32_t)0x00000004)
#define EXTEN_ISINK1_ADJ_3                      ((uint32_t)0x00000008)
#define EXTEN_ISINK1_ADJ_4                      ((uint32_t)0x00000010)
#define EXTEN_ISINK1_ADJ_5                      ((uint32_t)0x00000020)

#define EXTEN_ISINK1_DAT                        ((uint32_t)0x0000FFC0) /* ISINK1_DAT[9:0] bits*/
#define EXTEN_ISINK1_DAT_0                      ((uint32_t)0x00000040)
#define EXTEN_ISINK1_DAT_1                      ((uint32_t)0x00000080)
#define EXTEN_ISINK1_DAT_2                      ((uint32_t)0x00000100)
#define EXTEN_ISINK1_DAT_3                      ((uint32_t)0x00000200)
#define EXTEN_ISINK1_DAT_4                      ((uint32_t)0x00000400)
#define EXTEN_ISINK1_DAT_5                      ((uint32_t)0x00000800)
#define EXTEN_ISINK1_DAT_6                      ((uint32_t)0x00001000)
#define EXTEN_ISINK1_DAT_7                      ((uint32_t)0x00002000)
#define EXTEN_ISINK1_DAT_8                      ((uint32_t)0x00004000)
#define EXTEN_ISINK1_DAT_9                      ((uint32_t)0x00008000)

#define EXTEN_ISINK2_ADJ                        ((uint32_t)0x003F0000) /* ISINK2_ADJ[5:0] bits*/
#define EXTEN_ISINK2_ADJ_0                      ((uint32_t)0x00010000)
#define EXTEN_ISINK2_ADJ_1                      ((uint32_t)0x00020000)
#define EXTEN_ISINK2_ADJ_2                      ((uint32_t)0x00040000)
#define EXTEN_ISINK2_ADJ_3                      ((uint32_t)0x00080000)
#define EXTEN_ISINK2_ADJ_4                      ((uint32_t)0x00100000)
#define EXTEN_ISINK2_ADJ_5                      ((uint32_t)0x00200000)

#define EXTEN_ISINK2_DAT                        ((uint32_t)0xFFC00000) /* ISINK2_DAT[9:0] bits*/
#define EXTEN_ISINK2_DAT_0                      ((uint32_t)0x00400000)
#define EXTEN_ISINK2_DAT_1                      ((uint32_t)0x00800000)
#define EXTEN_ISINK2_DAT_2                      ((uint32_t)0x01000000)
#define EXTEN_ISINK2_DAT_3                      ((uint32_t)0x02000000)
#define EXTEN_ISINK2_DAT_4                      ((uint32_t)0x04000000)
#define EXTEN_ISINK2_DAT_5                      ((uint32_t)0x08000000)
#define EXTEN_ISINK2_DAT_6                      ((uint32_t)0x10000000)
#define EXTEN_ISINK2_DAT_7                      ((uint32_t)0x20000000)
#define EXTEN_ISINK2_DAT_8                      ((uint32_t)0x40000000)
#define EXTEN_ISINK2_DAT_9                      ((uint32_t)0x80000000)

#include "ch32m030_conf.h"

#ifdef __cplusplus
}
#endif

#endif /* __CH32M030_H */
